{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "A1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false, "name": "A1"}, "inbound_nodes": []}, {"name": "A2", "class_name": "Dense", "config": {"name": "A2", "trainable": true, "units": 92, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["A1", 0, 0, {}]]]}, {"name": "A3", "class_name": "Dropout", "config": {"name": "A3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["A2", 0, 0, {}]]]}, {"name": "A4", "class_name": "Dense", "config": {"name": "A4", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["A3", 0, 0, {}]]]}, {"name": "A5", "class_name": "Dropout", "config": {"name": "A5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["A4", 0, 0, {}]]]}], "input_layers": [["A1", 0, 0]], "output_layers": [["A5", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}